* 오늘의한자
  #+BEGIN_SRC emacs-lisp
    (let* ((days (time-to-day-in-year (current-time)))
           (mod (/ (length hanja-grade3) 3))
           (hit (% days  mod))
           (hit-1 (% (- days 1)  mod)))
      (setf today-hanja3
            (format "%s;%s;%s"
                    (nth hit hanja-grade3)
                    (nth (+ mod hit) hanja-grade3)
                    (nth (+ mod mod hit) hanja-grade3)))

      (setf today-hanja4
            (format "%s;%s;%s;%s" 
                    (nth hit hanja-grade4)
                    (nth (+ mod hit) hanja-grade4)
                    (nth (+ mod mod hit) hanja-grade4)
                    (nth (+ mod mod mod hit) hanja-grade4)))

      (setf yesterday-hanja3
            (format "%s;%s;%s"
                    (nth hit-1 hanja-grade3)
                    (nth (+ mod hit-1) hanja-grade3)
                    (nth (+ mod mod hit-1) hanja-grade3)))

      (setf yesterday-hanja4
            (format "%s;%s;%s;%s" 
                    (nth hit-1 hanja-grade4)
                    (nth (+ mod hit-1) hanja-grade4)
                    (nth (+ mod mod hit-1) hanja-grade4)
                    (nth (+ mod mod mod hit-1) hanja-grade4))))

    (spacemacs-buffer/warning
     (today-message "어제의 한자 3급 %s" yesterday-hanja3))

    (spacemacs-buffer/warning
     (today-message "어제의 한자 4급 %s" yesterday-hanja4))


    (spacemacs-buffer/warning
     (today-message "오늘의 한자 3급 %s" today-hanja3))

    (spacemacs-buffer/warning
     (today-message "오늘의 한자 4급 %s" today-hanja4))

  #+END_SRC

  #+RESULTS:
  | Cannot find any of the specified fonts (Source Code Pro)! Font settings may not be correct. | Both the `helm' and `ivy' layers are enabled. This may lead to unexpected behaviour. | More than one init function found for package helm-make. Previous owner was helm, replacing it with layer ivy. | 어제의 한자 3급 (蜜 : 꿀밀);(潤 : 불을윤);(荒 : 거칠황) | 어제의 한자 4급 (問 : 물을문);(音 : 소리음);(紅 : 붉을홍);nil | 오늘의 한자 3급 (朴 : 순박할박);(隱 : 숨을은);(回 : 돌아올회) | 오늘의 한자 4급 (聞 : 들을문);(飮 : 마실음);(火 : 불화);nil |
 

* 오늘의 카타카나 
  #+BEGIN_SRC emacs-lisp

    (defun katakanahanja (it)
        (let ((result  (assoc (car it) katakana→hanja)))
          (if result result (assoc (car (reverse it )) katakana→hanja))))
      (defun daykatakana (dayoffset)
        (let ((it  (nth  (%  (-  (time-to-day-in-year (current-time)) dayoffset) (length  katakana) ) katakana)))
          (format  "%s%s"
                   (s-join ";" (-map #'symbol-name it))
                   (format "%s" (getmean (cadr  (katakanahanja it)))   ))))
      (spacemacs-buffer/warning
       (today-message "어제의 카타카나 %s" (daykatakana 1) ))
      (spacemacs-buffer/warning
       (today-message "오늘의 카타카나 %s" (daykatakana 0)))
  #+END_SRC

  #+RESULTS:
  | Cannot find any of the specified fonts (Source Code Pro)! Font settings may not be correct. | More than one init function found for package helm-make. Previous owner was helm, replacing it with layer ivy. | Auto-evilication could not remap these functions in map `elfeed-search-mode-map': |

** xmodmap

   xmodmap -pke 하면 적용되어 있는 키값을 확인할 수 있다. 
   #+begin_src emacs-lisp
     (when-os 'gnu/linux
       (call-process "/usr/bin/xmodmap" nil nil nil "/opt/site-lisp/init/xmodmap.conf"))
   #+end_src

   #+RESULTS:
   : 0
* alarm
   #+BEGIN_SRC emacs-lisp 

  (let* ((ct (decode-time (current-time)))
         (ctm (+  (cadr ct) (* 60 (caddr ct)))))
    (if (not (> ctm (+ (* 10  60 ) 0  )))
        (myalarm "10:00" (format "휴식하시요. %s\n%s\n%s" (daykatakana 0) today-hanja3 today-hanja4)))
    (if (not (> ctm (+ (* 15  60 ) 0  )))
        (myalarm "15:00" (format "휴식하시요. %s\n%s\n%s" (daykatakana 0) today-hanja3 today-hanja4)))
    (if (not (> ctm (+ (* 18  60 ) 10 )))
        (myalarm "18:10" (format "퇴근하시요. %s\n%s\n%s" (daykatakana 0) today-hanja3 today-hanja4)))
    (if (not (> ctm (+ (* 19  60 ) 20 )))
        (myalarm "19:20" (format "퇴근하시요. %s\n%s\n%s" (daykatakana 0) today-hanja3 today-hanja4)))
    (if (not (> ctm (+ (* 20  60 ) 20 )))
        (myalarm "21:20" (format "퇴근하시요. %s\n%s\n%s" (daykatakana 0) today-hanja3 today-hanja4))))
  
  (run-at-time "12:20" nil 'garbage-collect)


   #+END_SRC

   #+RESULTS:
   : [nil 22698 57072 0 nil alarm-clock-message ("퇴근하시요. チャ;cha;차") nil 0]

*** font size
    #+BEGIN_SRC emacs-lisp

    (setf dongil/efontsize  14)
    (setf dongil/hfontsize  17)
    (setf dongil/symbolsize 15)

    #+END_SRC

    #+RESULTS:
    : 15

*** fontlock 설정 
    #+BEGIN_SRC emacs-lisp
    (setq 
     font-lock-maximum-decoration 
     '(
       (c-mode . t)
       ;;(c++-mode . 1)
       (c++-mode . 2)
       (t . t)
       ))

    ;; (use-package unicode-fonts
    ;;   :config
    ;;   (unicode-fonts-setup))

    ;;(setq font-lock-support-mode 'fast-lock-mode ; lazy-lock-mode jit-lock-mode
    ;;      fast-lock-cache-directories '("~/.emacs-flc"))

    ;; 모드별로 키워드 추가가 가능하다. 
    ;; http://www.emacswiki.org/emacs/AddKeywords
    ;;FONT-LOCK;;(defvar font-lock-comment-face   'font-lock-comment-face
    ;;FONT-LOCK;;  "Face name to use for comments.")

    ;;customize;;(font-lock-add-keywords 'python-mode
    ;;customize;;  '(("\\btry\\b" . font-lock-keyword-face)
    ;;customize;;    ("\\bfinally\\b" . font-lock-keyword-face)
    ;;customize;;    ("\\bwith\\b" . font-lock-keyword-face)
    ;;customize;;    ("\\bas\\b" . font-lock-keyword-face)
    ;;customize;;    ))




    ;; https://en.wikipedia.org/wiki/Unicode_block
    ;; https://www.gnu.org/software/emacs/manual/html_node/emacs/Modifying-Fontsets.html


    ;;; 22.15 Modifying Fontsets
    ;;; 
    ;;; Fontsets do not always have to be created from scratch. If only minor changes are required it may be easier to modify an existing fontset. Modifying ‘fontset-default’ will also affect other fontsets that use it as a fallback, so can be an effective way of fixing problems with the fonts that Emacs chooses for a particular script.
    ;;; 
    ;;; Fontsets can be modified using the function set-fontset-font, specifying a character, a charset, a script, or a range of characters to modify the font for, and a font specification for the font to be used. Some examples are:
    ;;; 
    ;;; ;; Use Liberation Mono for latin-3 charset.
    ;;; (set-fontset-font "fontset-default" 'iso-8859-3
    ;;;                   "Liberation Mono")
    ;;; 
    ;;; ;; Prefer a big5 font for han characters
    ;;; (set-fontset-font "fontset-default"
    ;;;                   'han (font-spec :registry "big5")
    ;;;                   nil 'prepend)
    ;;; 
    ;;; ;; Use DejaVu Sans Mono as a fallback in fontset-startup
    ;;; ;; before resorting to fontset-default.
    ;;; (set-fontset-font "fontset-startup" nil "DejaVu Sans Mono"
    ;;;                   nil 'append)
    ;;; 
    ;;; ;; Use MyPrivateFont for the Unicode private use area.
    ;;; (set-fontset-font "fontset-default"  '(#xe000 . #xf8ff)
    ;;;                   "MyPrivateFont")

    #+END_SRC

    #+RESULTS:
    : ((c-mode . t) (c++-mode . 2) (t . t))

* calendar
  #+begin_src emacs-lisp :tangle no
(cfw:open-org-calendar)
  #+end_src

  #+RESULTS:
  : Warn : open org-agenda buffer first.

* temporary
  #+begin_src emacs-lisp

  (add-to-list 'org-file-apps '("\\.png" . (lambda (file link) (w32-shell-execute "Open" (win-path-convert-file-name file))))) 
  #+end_src

  #+RESULTS:
  : ((\.png lambda (file link) (w32-shell-execute Open (win-path-convert-file-name file))) (auto-mode . emacs) (\.mm\' . default) (\.x?html?\' . default) (\.pdf\' . default) (\.xls[x]\' . system) (\.doc[x]\' . system) (\.ppt[x]\' . system) (t . emacs) (\.png . system))

